Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: This is very helpful for code review or to quickly browse what happened during a series of commits that a collaborator has added.
cs: Je to velmi užitečné při kontrole kódu nebo k rychlému zjištění, co se stalo v posloupnosti revizí, které přidal váš spolupracovník.

source: This is very similar to what `receive-pack` responds with, but the capabilities are different.
cs: Informace se nápadně podobají těm, jimiž odpovídá proces `receive-pack`, liší se však schopnosti.

source: This kind of workflow isn't common, but can be useful in very big projects, or in highly hierarchical environments.
cs: Tento typ pracovního postupu sice není běžný, ale může být užitečný u velmi velkých projektů nebo v přísně hierarchických prostředích.

source: This leads us to the three main sections of a Git project: the Git directory, the working directory, and the staging area.
cs: Z toho vyplývá, že projekt je v systému Git rozdělen do tří hlavních částí: adresář systému Git (Git directory), pracovní adresář (working directory) a oblast připravených změn (staging area).

source: This lets you clone another repository into your project and keep your commits separate.
cs: Do svého projektu tak můžete naklonovat jiný repozitář a uchovávat revize oddělené.

source: This looks a bit different than the `hotfix` merge you did earlier.
cs: Tady už se to od dřívějšího slučování s větví `hotfix` trochu liší.

source: This makes Git more like a mini filesystem with some incredibly powerful tools built on top of it, rather than simply a VCS.
cs: Díky tomu Git vypadá (spíše než jiné systémy pro správu verzí) jako malý souborový systém, nad kterým pracuje sada neuvěřitelně výkonných nástrojů.

source: This makes for a very powerful revision query system that should help you figure out what is in your branches.
cs: Tím máte v rukou velmi efektivní systém vyhledávání revizí, který vám pomůže zjistit, co vaše větve obsahují.

source: This makes merging a heck of a lot easier in Git than in these other systems.
cs: Tím se slučování větví v Gitu stává o dost jednodušší, než je tomu v ostatních systémech.

source: This makes the following two commands equivalent:
cs: Po zadání takového příkazu budete mít k dispozici dva ekvivalentní příkazy:

source: This makes using Git a joy because we know we can experiment without the danger of severely screwing things up.
cs: Díky tomu je práce s Gitem radostí, protože víme, že můžeme experimentovat bez nebezpečí závažného poškození hotových věcí.

source: This makes your `import` command look like this:
cs: Váš příkaz `import` pak bude mít tuto podobu:

source: This may be a bit confusing, so let's look at an example.
cs: Mohlo by to být trochu matoucí, takže si uveďme příklad.

source: This may not seem like a huge deal, but you may be surprised what a big difference it can make.
cs: Možná to vypadá jako maličkost, ale divili byste se, jak velký je v tom rozdíl.

source: This means it's impossible to change the contents of any file or directory without Git knowing about it.
cs: To znamená, že není možné změnit obsah jakéhokoli souboru nebo adresáře, aniž by o tom Git nevěděl.

source: This means that if two developers clone from the hub and both make changes, the first developer to push their changes back up can do so with no problems.
cs: To znamená, že pokud dva vývojáři klonují z centrálního úložiště a oba provedou změny, pak jen první z nich může bez problémů odeslat (push) své změny zpět.

source: This means that if you commit at this point, the `master` branch will be moved forward with your new work.
cs: To znamená, že pokud teď zapíšete revizi, bude se s novou prací posunovat větev `master`.

source: This means that there is generally no pushing over this protocol.
cs: To znamená, že se přes tento protokol nedají odesílat žádné revize.

source: This means that, for example, instead of typing `git commit`, you just need to type `git ci`.
cs: To znamená, že například místo kompletního příkazu `git commit` stačí zadat pouze zkrácené `git ci`.

source: This means the tag directly above is an annotated tag and that line is the commit that the annotated tag points to.
cs: Tento řádek znamená, že značka bezprostředně nad ním je anotovaná a tento řádek je revize, na niž tato anotovaná značka ukazuje.

source: This means the version in `HEAD` (your `master` branch, because that was what you had checked out when you ran your merge command) is the top part of that block (everything above the `=======`), while the version in your `iss53` branch looks like everything in the bottom part.
cs: To znamená, že verze v `HEAD` (což je vaše větev `master`, protože jste na ni byli přepnutí, když jste spouštěli příkaz `merge`) je uvedena v horní části tohoto bloku (všechno nad oddělovačem `=======`), zatímco verze z větve `iss53` je uvedena v dolní části.

source: This means we can pull contributions from any of these users pretty easily.
cs: To znamená, že můžeme celkem snadno stáhnout příspěvky od kteréhokoli z těchto uživatelů.

source: This means you can do local branching and merging, use the staging area, use rebasing and cherry-picking, and so on, while your collaborators continue to work in their dark and ancient ways.
cs: To znamená, že můžete vytvářet nové lokální větve a slučovat je, používat oblast připravených změn, přeskládávat, částečně přejímat atd., zatímco vaši spolupracovníci budou dále pracovat svými zašlými a prastarými způsoby.

source: This means you can have several branches that are always open and that you use for different stages of your development cycle; you can merge regularly from some of them into others.
cs: To znamená, že můžete mít neustále otevřeno několik větví a můžete je používat pro různé fáze vývojového cyklu. Některé z nich můžete pravidelně slučovat s jinými.

source: This means you have a clean working directory – in other words, there are no tracked and modified files.
cs: To znamená, že váš pracovní adresář je čistý. Jinými slovy, nejsou v něm žádné sledované soubory, které by byly změněny.

source: This means you see the project history almost instantly.
cs: Znamená to, že se historie projektu zobrazí téměř hned.

source: This means your future commit will have one parent only and allows you to introduce all the changes from another branch and then make more changes before recording the new commit.
cs: To znamená, že váš budoucí objekt revize bude mít jen jednoho rodiče a přitom vám umožní vnést všechny změny z jiné větve a poté provést další úpravy ještě před tím, než se nová revize zapíše.

source: This modifies the files in your working directory.
cs: Tím změníte soubory ve svém pracovním adresáři.

source: This moves `HEAD` to point to the `testing` branch.
cs: Tím se `HEAD` se přesune a ukazuje na větev `testing`.

source: This object also contains the author's name and email, the message that you typed, and pointers to the commit or commits that directly came before this commit (its parent or parents): zero parents for the initial commit, one parent for a normal commit, and multiple parents for a commit that results from a merge of two or more branches.
cs: Tento objekt obsahuje také jméno a e-mail autora, zprávu, kterou jste napsali, a odkazy na jeden nebo víc objektů revize, které této revizi přímo předcházely (jeho rodiče): na žádného rodiče pro počáteční revizi, na jednoho rodiče pro běžnou revizi a na více rodičů pro revizi, která je výsledkem sloučení dvou nebo více větví.

source: This object type is called a blob.
cs: Tento typ objektu se nazývá blob.

source: This occurs fairly commonly.
cs: Toto je opravdu velmi častá situace.

source: This only works if C4 and C4' that your partner made are almost exactly the same patch.
cs: Funguje to jen tehdy, když C4 a C4', které vytvořil váš partner, představují téměř shodné záplaty.

source: This opens a vast range of workflow possibilities for your project and/or your team, so we'll cover a few common paradigms that take advantage of this flexibility.
cs: Tím se pro váš projekt a váš tým otvírá široké spektrum pracovních postupů. Podíváme se na pár obvyklých přístupů, které dané pružnosti využívají.

source: This option adds a nice little ASCII graph showing your branch and merge history:
cs: Tato volba přidá pěkný malý ASCII graf, znázorňující vaši větev a historii slučování:

source: This option changes the log output to formats other than the default.
cs: Změní výstup logu na jiný než výchozí formát.

source: This option displays the same information but with a diff directly following each entry.
cs: Tato volba zobrazí stejné informace, ale za každým záznamem následuje informace o rozdílech.

source: This option is called `--decorate`.
cs: Potřebná volba se jmenuje `--decorate`.

source: This process is just like sharing remote branches – you can run `git push origin [tagname]`.
cs: Tento proces se velmi podobá sdílení vzdálených větví -- můžete provést `git push origin [název-značky]`.

source: This process is similar across all operating systems.
cs: Tento proces se napříč operačními systémy téměř neliší.

source: This prompted the Linux development community (and in particular Linus Torvalds, the creator of Linux) to develop their own tool based on some of the lessons they learned while using BitKeeper.(((Linus Torvalds))) Some of the goals of the new system were as follows:
cs: To přimělo komunitu vývojářů Linuxu (a zejména Linuse Torvaldse, tvůrce Linuxu), aby vyvinula vlastní nástroj, založený na poznatcích, které nasbírala při užívání systému BitKeeper.(((Linus Torvalds))) Některé z cílů nového systému byly následující:

source: This pulls the same change introduced in `e43a6`, but you get a new commit SHA-1 value, because the date applied is different.
cs: Tímto natáhnete stejnou změnu, která byla provedena revizí `e43a6`, avšak hodnota SHA-1 obou revizí se bude lišit, neboť bude rozdílné datum aplikace.

source: This replays your `server` work on top of your `master` work, as shown in <<rbdiag_h>>.
cs: Příkaz přehraje práci z větve `server` k práci ve větvi `master` -- viz <<rbdiag_h, obrázek>>.

source: This resolution has a little of each section, and the `<<<<<<<`, `=======`, and `>>>>>>>` lines have been completely removed.
cs: Toto řešení obsahuje trochu z každé části a řádky `<<<<<<<`, `=======` a `>>>>>>>` byly úplně odstraněny.

source: This rewrites your history to now look like <<psp_b>>.
cs: Tím se vaše historie přepíše a bude vypadat jako na obrázku <<psp_b>>.

source: This scenario often includes a canonical repository that represents the ``official'' project.
cs: Tento scénář často zahrnuje jeden hlavní repozitář, který reprezentuje „oficiální“ projekt.

source: This section outlines the various ways you can refer to a single commit.
cs: Tato část uvede několik různých způsobů, jak lze určit jednu konkrétní revizi.

source: This section will cover some of these scenarios.
cs: Tato část se na některé z těchto scénářů zaměří.

source: This section will quickly cover how these two main protocols operate.
cs: Tato část se ve stručnosti zaměří na to, jak tyto dva základní protokoly fungují.

source: This seems a bit clearer.
cs: Příkaz `unstage` vypadá srozumitelněji.

source: This server is at `git.team1.ourcompany.com`.
cs: Tento server se nachází na `git.team1.ourcompany.com`.

source: This sets up the properties to run the sync.
cs: Tím nastavíte vlastnosti synchronizace.

source: This setup offers many advantages, especially over local VCSs.
cs: Toto uspořádání nabízí mnoho výhod, zejména v porovnání s lokálními systémy pro správu verzí.

source: This shows your other branch.
cs: Tím se zobrazí jiná větev.

source: This technique allows you to context-switch quickly and completely – because your work is separated into silos where all the changes in that branch have to do with that topic, it's easier to see what has happened during code review and such.
cs: Tato technika umožňuje rychlé a snadné přepínání kontextu. A protože je vaše práce rozdělena do zásobníků, kde všechny změny v jedné větvi souvisejí s jedním tématem, je při kontrole kódu snazší dohledat, čeho se změny týkaly a podobné věci.

source: This technique can also be very useful in creating commands that you think should exist.
cs: Tato metoda může být velmi užitečná také k vytváření příkazů, které by podle vás měly existovat.

source: This technique only works for data that’s still in your reflog, so you can’t use it to look for commits older than a few months.
cs: Tato možnost funguje pouze pro data, jež jsou dosud v záznamu reflog. Nemůžete ji proto použít pro revize starší než několik měsíců.

source: This time, if you run `git show` on the tag, you don't see the extra tag information.(((git commands, show))) The command just shows the commit:
cs: Pokud spustíte příkaz `git show` pro značku tentokrát, nezobrazí se k ní žádné další informace.(((git příkazy, show))) Příkaz ukáže jen informaci o revizi:

source: This tool allows you to use Git as a valid client to a Subversion server, so you can use all the local features of Git and then push to a Subversion server as if you were using Subversion locally.
cs: Tento nástroj umožňuje používat Git jako platného klienta serveru Subversion. Můžete tak využívat všech lokálních funkcí systému Git, ale revize odesílat na server Subversion, jako byste tento systém používali i lokálně.

source: This type of output will become more interesting as we go through branching and merging in the next chapter.
cs: Tento typ výstupu nás začne víc zajímat, jakmile se v další kapitole začneme zabývat větvením a slučováním.

source: This was my introduction to a style of making software that felt more natural than anything I had seen before.
cs: Uvedla mě do stylu programování, při kterém jsem se cítil přirozeněji než u přístupů, s kterými jsem se do té doby potkal.

source: This way, projects don’t have to worry about adding users as collaborators to give them push access.
cs: Díky tomu se projekty nemusí starat o přidávání uživatelů do role spolupracovníků, kteří by měli právo zápisu.

source: This way, you can export a snapshot or build and name it something understandable to people.
cs: Díky tomu lze snímek nebo sestavení (build) vyexportovat a přiřadit mu pro člověka srozumitelný název.

source: This way, you can make sure your commits are logically separate changesets and can be easily reviewed by the developers working with you.
cs: Tímto způsobem zajistíte, že budou vaše revize logicky oddělenými sadami změn, jež mohou vaši spolupracovníci snadno zkontrolovat.

source: This way, you can see the last commit easily:
cs: Tímto způsobem snadno zobrazíte poslední revizi:

source: This will list out your local branches with more information including what each branch is tracking and if your local branch is ahead, behind or both.
cs: Zobrazí se seznam lokálních větví s dalšími informacemi včetně toho, co každá z větví sleduje a zda má vaše lokální větev náskok, nebo je pozadu, nebo obojí.

source: This will transfer all of your tags to the remote server that are not already there.
cs: Tím se na vzdálený server přenesou všechny vaše značky, které tam ještě nejsou.

source: This workflow is attractive to a lot of people because it's a paradigm that many are familiar and comfortable with.
cs: Tento pracovní postup je pro mnoho lidí zajímavý, protože je to model, který jsou zvyklí používat a jsou s ním spokojeni.

source: Those are only some simple output-formatting options to `git log` – there are many more.
cs: Uvedli jsme jen několik jednoduchých možností formátování výstupu příkazu `git log`. Existuje jich mnohem víc.

source: Though most of the commands we use should work even in ancient versions of Git, some of them might not or might act slightly differently if you're using an older version.
cs: Ačkoliv by měla většina příkazů fungovat i s historickými verzemi Gitu, některé z nich se mohou chovat při použití starší verze trošku jinak.

source: Thus if any server dies, and these systems were collaborating via it, any of the client repositories can be copied back up to the server to restore it.
cs: Pokud v takové situaci dojde ke kolapsu serveru a pokud jej tyto systémy využívaly, můžeme obsah serveru obnovit zkopírováním repozitáře od libovolného uživatele.

source: Thus it's a bit confusing that Git has a `mv` command.
cs: Takže se může zdát zvláštní, že Git přesto nabízí příkaz `mv`.

source: Thus these three commands are equivalent:
cs: Tyto tři příkazy jsou tedy ekvivalentní:

source: Thus, when you clone the Git repository, you have four branches that you can check out to evaluate the project in different stages of development, depending on how cutting edge you want to be or how you want to contribute; and the maintainer has a structured workflow to help them vet new contributions.
cs: Pokud tedy klonujete repozitář Git, můžete stáhnout až čtyři větve, a hodnotit tak projekt na čtyřech různých úrovních vývoje. Záleží na vás, do jaké hloubky chcete proniknout nebo jak chcete přispívat. A správce projektu má k dispozici strukturovaný pracovní postup k evaluaci nových příspěvků.

source: To add a local repository to an existing Git project, you can run something like this:
cs: K přidání lokálního repozitáře do existujícího gitového projektu můžete něco takového:

source: To allow read access to your repository over HTTP, do something like this:
cs: Chcete-li u svého repozitáře nastavit oprávnění pro čtení pomocí protokolu HTTP, proveďte následující:

source: To apply a patch generated by `format-patch`, you use `git am`.
cs: K aplikaci patche vygenerovaného příkazem `format-patch` použijte příkaz `git am`.

source: To avoid issues, you should delete the local branch (in this case, `opera`) after you merge it into trunk.
cs: Chcete-li se vyhnout možným problémům, smažte lokální větev (v našem případě `opera`) hned poté, co jste ji začlenili do kmenové větve (trunk).

source: To be able to collaborate on any Git project, you need to know how to manage your remote repositories.
cs: Abyste mohli na gitových projektech spolupracovat, je třeba vědět, jak manipulovat se vzdálenými repozitáři (remote repositories).

source: To be efficient, if files have not changed, Git doesn't store the file again, just a link to the previous identical file it has already stored.
cs: Pokud se soubor nezměnil, pak ho Git v zájmu efektivnosti znovu neukládá, ale jen se odkáže na předchozí identický soubor, který už byl uložen.

source: To begin, she starts a new feature branch, basing it off the server's `master` branch:
cs: Začne tím, že založí novou větev, která bude založena na větvi `master` ze serveru:

source: To change that default to something else, you can use the `core.editor` setting:
cs: Chcete-li změnit výchozí hodnotu, použijte nastavení `core.editor`:

source: To clone a Git repository over SSH, you can specify ssh:// URL like this:
cs: Chcete-li naklonovat repozitář Git pomocí protokolu SSH, zadejte `ssh://` URL, například:

source: To clone a repository like this or to add one as a remote to an existing project, use the path to the repository as the URL.
cs: Při klonování takového repozitáře, nebo při jeho přidávání jako vzdáleného repozitáře existujícího projektu, se v roli URL používá cesta k repozitáři.

source: To contribute to that project, you create your own public clone of the project and push your changes to it.
cs: Chcete-li do tohoto projektu přispívat, vytvoříte vlastní veřejný klon projektu a odešlete do něj změny, které jste provedli.

source: To create a branch and switch to it at the same time, you can run the `git checkout` command with the `-b` switch:
cs: Abyste vytvořili novou větev a rovnou na ni přepnuli, můžete spustit příkaz `git checkout` s přepínačem `-b`:

source: To create a branch back at the second commit, you can do this:
cs: Chcete-li vytvořit větev zpětně na druhé revizi, můžete zadat:

source: To create a commit object, you call `commit-tree` and specify a single tree SHA-1 and which commit objects, if any, directly preceded it.
cs: Pro vytvoření objektu revize zavolejte příkaz `commit-tree` a zadejte jeden SHA-1 stromu a eventuální objekty revize, které mu bezprostředně předcházely.

source: To create a lightweight tag, don't supply the `-a`, `-s`, or `-m` option:
cs: Chcete-li vytvořit prostou značku, nezadávejte ani jeden z parametrů `-a`, `-s` nebo `-m`:

source: To create a new branch in Subversion, you run `git svn branch [branchname]`:
cs: Chcete-li vytvořit novou větev v systému Subversion, spusťte příkaz `git svn branch [název větve]`:

source: To create a new reference that will help you remember where your latest commit is, you can technically do something as simple as this:
cs: Chcete-li vytvořit novou referenci, díky níž si budete pamatovat, kde se nachází vaše poslední revize, lze to technicky provést velmi jednoduše:

source: To deal with this issue, programmers long ago developed local VCSs that had a simple database that kept all the changes to files under revision control.
cs: Aby k těmto potížím nedocházelo, vyvinuli programátoři už dávno lokální systémy pro správu verzí. Byly založeny na jednoduché databázi, která uchovávala všechny změny souborů zařazených do správy revizí.

source: To deal with this problem, Centralized Version Control Systems (CVCSs) were developed.
cs: Pro vyřešení tohoto problému byly vyvinuty tzv. centralizované systémy pro správu verzí (CVCS z anglického Centralized Version Control System).

source: To demonstrate having multiple remote servers and what remote branches for those remote projects look like, let's assume you have another internal Git server that is used only for development by one of your sprint teams.
cs: Abychom si mohli ukázat, jak se pracuje s několika vzdálenými servery a jak vypadají vzdálené větve takových vzdálených projektů, předpokládejme, že máte ještě další interní server Git, který při vývoji používá pouze jeden z vašich sprint týmů{empty}footnote:[Pozn. překl.: Pojem „sprint tým“ pochází z agilní vývojové metodologie https://cs.wikipedia.org/wiki/Scrum[Scrum].].

source: To demonstrate this functionality, you need a typical SVN repository that you have write access to.
cs: Abychom si mohli tuto funkci ukázat, budete potřebovat typický repozitář SVN, k němuž máte oprávnění pro zápis.

source: To demonstrate, you can use the plumbing command `hash-object`, which takes some data, stores it in your `.git` directory, and gives you back the key the data is stored as.
cs: Abychom to předvedli, můžete použít nízkoúrovňový příkaz `hash-object`, který vezme určitá data, uloží je v adresáři `.git` a vrátí vám klíč, pod nímž jsou tato data uložena.

source: To demonstrate, you’ll go into your project and start working on a couple of files and possibly stage one of the changes.
cs: Pro názornost uvažujme situaci, že ve svém projektu začnete pracovat na několika souborech a jednu z provedených změn připravíte k zapsání.

source: To do that, you must run the `git stash apply` command with a `--index` option to tell the command to try to reapply the staged changes.
cs: Chcete-li, aby se příkaz pokusil znovu aplikovat i změny připravené k zapsání, musíte zadat příkaz `git stash apply` s parametrem `--index`.

source: To do this properly, you need a small script that takes a filename, figures out the last commit date for this project, and inserts the date into the file.
cs: Ke správnému postupu budete potřebovat malý skript, který vezme název souboru, zjistí datum poslední revize v tomto projektu a vloží datum do souboru.

source: To do this, use the `--cached` option:
cs: Provedete to pomocí volby `--cached`:

source: To do this, you can add the `commit-msg` hook.
cs: K tomuto účelu můžete použít zásuvný modul `commit-msg`.
